In [1]:
import pandas as pd

sample_data = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9],
]

In [2]:
id = ["1行目", "2行目", "3行目"]
col = ["1列目", "2列目", "3列目"]

df = pd.DataFrame(sample_data, index=id, columns=col)
df

     1列目  2列目  3列目
1行目    1    2    3
2行目    4    5    6
3行目    7    8    9

In [3]:
len(df)

3

In [4]:
df["2列目"]

1行目    2
2行目    5
3行目    8
Name: 2列目, dtype: int64

In [5]:
df[["1列目", "2列目"]]

     1列目  2列目
1行目    1    2
2行目    4    5
3行目    7    8

In [6]:
df.iloc[0]

1列目    1
2列目    2
3列目    3
Name: 1行目, dtype: int64

In [7]:
df10 = df.drop("2列目", axis=1)
df10

     1列目  3列目
1行目    1    3
2行目    4    6
3行目    7    9

In [8]:
df11 = df.drop(columns="2列目")
df11

     1列目  3列目
1行目    1    3
2行目    4    6
3行目    7    9

In [9]:
df12 = df.drop(columns='2列目')
df12

     1列目  3列目
1行目    1    3
2行目    4    6
3行目    7    9

In [10]:
df13 = df.drop(columns=["2列目", "3列目"])
df13

     1列目
1行目    1
2行目    4
3行目    7

In [11]:
sample_data2 = [
    [10, 20, 30],
    [40, 50, 60],
    [70, None, 90],
]

id2 = ["1行目", "2行目", "3行目"]
col2 = ["4列目", "5列目", "6列目"]

df2 = pd.DataFrame(sample_data2, index=id2, columns=col2)
df2

     4列目   5列目  6列目
1行目   10  20.0   30
2行目   40  50.0   60
3行目   70   NaN   90

In [12]:
df3 = pd.concat([df, df2], axis=1)
df3

     1列目  2列目  3列目  4列目   5列目  6列目
1行目    1    2    3   10  20.0   30
2行目    4    5    6   40  50.0   60
3行目    7    8    9   70   NaN   90

In [13]:
df3.isnull().sum()

1列目    0
2列目    0
3列目    0
4列目    0
5列目    1
6列目    0
dtype: int64

In [14]:
df4 = df3.dropna()
df4

     1列目  2列目  3列目  4列目   5列目  6列目
1行目    1    2    3   10  20.0   30
2行目    4    5    6   40  50.0   60

In [15]:
df3["4列目"]

1行目    10
2行目    40
3行目    70
Name: 4列目, dtype: int64

In [16]:
df3["4列目"] > 50

1行目    False
2行目    False
3行目     True
Name: 4列目, dtype: bool

In [17]:
df5 = df3[df3["4列目"] > 50]
df5

     1列目  2列目  3列目  4列目  5列目  6列目
3行目    7    8    9   70  NaN   90

In [18]:
for i in range(1, 5):
    print(i)

1
2
3
4

In [19]:
print(type("1行目"))
print(type(1))
print(type("1"))
print(type(1.23))
print(type("1.23"))
print(type(True))
print(type("True"))
print(type([1, 2, 3]))

<class 'str'>
<class 'int'>
<class 'str'>
<class 'float'>
<class 'str'>
<class 'bool'>
<class 'str'>
<class 'list'>

In [20]:
"今日は朝から雨模様だ。明日は晴天になるらしい。".split("。")

['今日は朝から雨模様だ', '明日は晴天になるらしい', '']

In [21]:
words = ["今日", "は", "朝", "から", "雨模様", "だ", "。"]
sentence = " ".join(words)
print(sentence)
sentence2 = "".join(words)
print(sentence2)

今日 は 朝 から 雨模様 だ 。
今日は朝から雨模様だ。

In [22]:
sample_sentence = """
        今日は朝から
        雨模様だ。明日は
        晴天になるらしい。
"""
print(sample_sentence)

        今日は朝から
        雨模様だ。明日は
        晴天になるらしい。

In [23]:
sample_sentence3 = "今日は朝から\
雨模様だ。明日は\
晴天になるらしい。"
print(sample_sentence3)

今日は朝から雨模様だ。明日は晴天になるらしい。

In [24]:
import pandas as pd
birth = pd.read_csv("data/chapter02.csv", encoding="Shift-jis")

In [25]:
birth.head()

  都道府県  合計特殊出生率 世帯年間収入
0  北海道     1.19  4,488
1   青森     1.28  4,952
2   岩手     1.39  5,282
3   宮城     1.27  5,702
4   秋田     1.31  5,274